src/DataProcessors/ВыполнениеОперацийПриПланировании/ВыполнениеОперацийПриПланировании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыполнениеОперацийПриПланировании</name>
</mdclass:DataProcessor>

src/Documents/ПроизводственнаяОперация2_2/ПроизводственнаяОперация2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводственнаяОперация2_2</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТрудозатратыКОформлению</registerRecords>
  <attributes>
    <name>Этап</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.ТехнологическиеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОперации</name>
    <comment>Уникальный идентификатор операции в маршрутной карте</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроизводственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>DefinedType.ИсполнительРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабочегоЦентра</name>
    <type>
      <types>CatalogRef.ВидыРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийЦентр</name>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНаладки</name>
    <type>
      <types>CatalogRef.ВариантыНаладки</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНаКонтроле</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНаДоработке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБрак</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОтменено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <comment>Реквизит является справочным, так как рассчитывается с округлением на основании времени штучного и времени ПЗ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоВыполнения</name>
    <comment>Фактическая дата начала выполнения</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеВыполнения</name>
    <comment>Фактическая дата окончания выполнения</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОперацииЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаОснованииПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОснованииНСИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СменноеЗадание</name>
    <type>
      <types>DocumentRef.СменноеЗадание</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыТехнологическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноПовторить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетПовторения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноПропустить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.ПроизводственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтрокиТрудозатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияКакРаспоряжениеВыработки</name>
    <comment>Служебный реквизит. Необходим для перевода механизма учета трудозатрат с этапа производства на производственную операцию</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>EnumRef.ВариантыКонтроляТехнологическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторныйКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыходныеИзделия</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыходныеИзделияСерии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураМаршрутнойКарты</name>
      <comment>Служебный реквизит - хранит данные маршрутной карты</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаМаршрутнойКарты</name>
      <comment>Служебный реквизит - хранит данные маршрутной карты</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковкаМаршрутнойКарты</name>
      <comment>Служебный реквизит - хранит данные маршрутной карты</comment>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Трудозатраты</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРаботСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>DefinedType.ИсполнительРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Протокол</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>EnumRef.СобытияПротоколаПроизводственнойОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредыдущееСостояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/РабочиеЦентры/РабочиеЦентры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеЦентры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидРабочегоЦентра</name>
    <type>
      <types>CatalogRef.ВидыРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентВремениРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяЗагрузка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасценкаРабота</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>РасценкаПереналадка</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.ПроизводственныеУчастки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ВыполнениеОперацийПриПланировании/Forms/РабочееМесто/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Подразделение") Тогда
		Подразделение = Параметры.Подразделение;
	КонецЕсли;
	
	ИспользуетсяГрафикПроизводства = УправлениеПроизводством.ИспользуетсяГрафикПроизводства();
	
	АктивныеСостояния = АктивныеСостояния();
	Состояние.ЗагрузитьЗначения(АктивныеСостояния);
	
	УстановитьТипРабочегоЦентра(ЭтаФорма);
	УстановитьТипИсполнителя();
	
	УстановитьСвойстваДинамическогоСпискаВыполнениеОпераций();
	УстановитьСвойстваДинамическогоСпискаОперации();
	
	УстановитьОтборПоПодразделениюУчастку();
	УстановитьОтборПоРабочемуЦентру();
	УстановитьОтборПоСостоянию();
	
	Если Параметры.Свойство("ОтборПоЭтапам") Тогда
		УстановитьОтборПоЭтапам(Параметры.ОтборПоЭтапам);
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПроизводственныеУчастки КАК ПроизводственныеУчастки
		|		ПО СтруктураПредприятия.Ссылка = ПроизводственныеУчастки.Владелец
		|ГДЕ
		|	СтруктураПредприятия.ИспользоватьПооперационноеПланирование
		|	И СтруктураПредприятия.ИспользоватьПроизводственныеУчастки");
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьУчастки = НЕ Запрос.Выполнить().Пустой();
	УстановитьПривилегированныйРежим(Ложь);	
	
	Элементы.ОтборПодразделениеЗаголовок.Видимость  = НЕ ИспользоватьУчастки;
	Элементы.ОтборПодразделениеЗаголовок1.Видимость = НЕ ИспользоватьУчастки;
	Элементы.ТипОтбораПодразделение.Видимость  = ИспользоватьУчастки;
	Элементы.ТипОтбораПодразделение1.Видимость = ИспользоватьУчастки;
	
	НастроитьЗависимыеЭлементыФормы();
	
	РегистрыСведений.ЗаданияКРасчетуОчередиПроизводственныхОпераций.ЗапуститьЗадание();
	
	#Область СтандартныеМеханизмы
	
	// ПодключаемоеОборудование
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	// Конец ПодключаемоеОборудование
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	СписокТипов = Операции.КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Ссылка")).Тип;
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = СписокТипов;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюПечать;
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтаФорма, Элементы.КомандыОперацииГлобальныеКоманды);
	// Конец ИнтеграцияС1СДокументооборотом
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "Запись_ПроизводственнаяОперация2_2"
		И ТипЗнч(Параметр) = Тип("Структура")
		И Параметр.Свойство("Подразделение")
		И Параметр.Подразделение = Подразделение
		И Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВыполнениеОпераций Тогда
		
		Элементы.ВыполнениеОпераций.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		
		// Отборы установлены через параметры, сохраненные настройки не используются
		
		Настройки.Удалить("Подразделение");
		Настройки.Удалить("Участок");
		Настройки.Удалить("РабочийЦентр");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Настройки["Подразделение"] <> Неопределено Тогда
		
		ТипОтбораПодразделение = ?(НЕ Участок.Пустая() И ИспользоватьУчастки, 1, 0);
		
		Если ТипЗнч(РабочийЦентр) = Тип("СправочникСсылка.ВидыРабочихЦентров")
				ИЛИ НЕ ЗначениеЗаполнено(РабочийЦентр) Тогда
			ТипОтбораРабочийЦентр = 0;
		Иначе
			ТипОтбораРабочийЦентр = 1;
		КонецЕсли;
		
		ПодразделениеПриИзмененииНаСервере(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ВыполнениеОпераций

&НаКлиенте
Процедура ВыполнениеОпераций_Обновить(Команда)
	
	Элементы.ВыполнениеОпераций.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеОпераций_Создать(Команда)
	
	ТекущиеДанные = Элементы.ВыполнениеОпераций.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Элементы.ВыполнениеОпераций.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		Или ТекущиеДанные.ОжиданиеСоздания = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для выбранной строки!';
										|en = 'Command cannot be executed for the selected line.'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуДобавленияОперации(ТекущиеДанные, "Создать");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеОпераций_ПринятьВРаботу(Команда)
	
	ТекущиеДанные = Элементы.ВыполнениеОпераций.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Элементы.ВыполнениеОпераций.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		Или ТекущиеДанные.МожноВыполнять = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для выбранной строки!';
										|en = 'Command cannot be executed for the selected line.'"));
		Возврат;
	КонецЕсли;
	
	Если (ТекущиеДанные.Запланировано - ТекущиеДанные.ОжиданиеСоздания)
		- (ТекущиеДанные.Выполняется + ТекущиеДанные.Выполнено) > 0 Тогда
		ОткрытьФормуСпискаОпераций(ТекущиеДанные, "ПринятьВРаботу");
	Иначе
		ОткрытьФормуДобавленияОперации(ТекущиеДанные, "ПринятьВРаботу");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеОпераций_ОтметитьВыполнение(Команда)
	
	ТекущиеДанные = Элементы.ВыполнениеОпераций.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Элементы.ВыполнениеОпераций.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		Или (ТекущиеДанные.МожноВыполнять + ТекущиеДанные.Выполняется) = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для выбранной строки!';
										|en = 'Command cannot be executed for the selected line.'"));
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Запланировано - ТекущиеДанные.ОжиданиеСоздания - ТекущиеДанные.Выполнено > 0
		ИЛИ ТекущиеДанные.Выполняется > 0 Тогда
		ОткрытьФормуСпискаОпераций(ТекущиеДанные, "ОтметитьВыполнение");
	Иначе
		ОткрытьФормуДобавленияОперации(ТекущиеДанные, "ОтметитьВыполнение");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Операции

&НаКлиенте
Процедура Операции_НазначитьРабочийЦентр(Команда)
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Операции);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВидРабочегоЦентра = Неопределено;
	ОтборПоУчастку    = Неопределено;	
	
	Для каждого Ссылка Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Операции.ДанныеСтроки(Ссылка);
			
		Если НЕ ДанныеСтроки.ВидРабочегоЦентра.Пустая() Тогда
			
			Если ВидРабочегоЦентра = Неопределено Тогда
					
				ВидРабочегоЦентра = ДанныеСтроки.ВидРабочегоЦентра;
				
			ИначеЕсли ВидРабочегоЦентра <> ДанныеСтроки.ВидРабочегоЦентра Тогда
				
				ПоказатьПредупреждение(, НСтр("ru = 'Выбраны операции с различными видами рабочих центров.';
												|en = 'Operations with different work center types are selected.'"));
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ДанныеСтроки.Участок.Пустая() Тогда
			
			Если ОтборПоУчастку = Неопределено Тогда
				
				ОтборПоУчастку = ДанныеСтроки.Участок;
				
			ИначеЕсли ОтборПоУчастку <> ДанныеСтроки.Участок Тогда
				
				ПоказатьПредупреждение(, НСтр("ru = 'Выбраны операции с различными участками.';
												|en = 'Operations with different areas are selected.'"));
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Подразделение", Подразделение);
	Если ОтборПоУчастку <> Неопределено Тогда
		Отбор.Вставить("Участок", ОтборПоУчастку);
	КонецЕсли;
	Если ВидРабочегоЦентра <> Неопределено Тогда
		Отбор.Вставить("ВидРабочегоЦентра", ВидРабочегоЦентра);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ВыбиратьВариантНаладки", Истина);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Операции", ВыделенныеСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОперацииНазначитьРабочийЦентрЗавершение",
		ЭтотОбъект, ДопПараметры);
	
	ОткрытьФорму("Справочник.РабочиеЦентры.ФормаВыбора",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацииНазначитьРабочийЦентрЗавершение(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
			ОперацииНазначитьРабочийЦентрНаСервере(ДопПараметры.Операции,
				РезультатЗакрытия.РабочийЦентр,
				РезультатЗакрытия.ВариантНаладки);
		Иначе
			ОперацииНазначитьРабочийЦентрНаСервере(ДопПараметры.Операции, РезультатЗакрытия);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Операции_ОтменитьНазначениеРабочегоЦентра(Команда)
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Операции);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОперацииНазначитьРабочийЦентрНаСервере(
		ВыделенныеСтроки,
		ПредопределенноеЗначение("Справочник.РабочиеЦентры.ПустаяСсылка"));
	
КонецПроцедуры

&НаКлиенте
Процедура Операции_УстановитьСтатусВыполняется(Команда)
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Операции);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'У выделенных в списке операций будет установлен статус ""Выполняется"". Продолжить?';
						|en = 'Status of the operations selected in the list will be set to ""In progress"". Continue?'");
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Операции", ВыделенныеСтроки);
	ДопПараметры.Вставить("Статус", "Выполняется");
	ДопПараметры.Вставить("СтатусПредставление", НСтр("ru = 'Выполняется';
														|en = 'In progress'"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"УстановитьСтатусОперацийЗавершение", 
		ЭтотОбъект, ДопПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура Операции_УстановитьСтатусВыполнена(Команда)
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Операции);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'У выделенных в списке операций будет установлен статус ""Выполнена"". Продолжить?';
						|en = 'Status of the operations selected in the list will be set to Completed. Continue?'");
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Операции", ВыделенныеСтроки);
	ДопПараметры.Вставить("Статус", "Выполнена");
	ДопПараметры.Вставить("СтатусПредставление", НСтр("ru = 'Выполнена';
														|en = 'Completed'"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"УстановитьСтатусОперацийЗавершение", 
		ЭтотОбъект, ДопПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура Операции_УстановитьСтатусНеВыполнена(Команда)
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Операции);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'У выделенных в списке операций будет установлен статус ""Не выполнена"". Продолжить?';
						|en = 'Status of the operations selected in the list will be set to Failed. Continue?'");
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Операции", ВыделенныеСтроки);
	ДопПараметры.Вставить("Статус", "НеВыполнена");
	ДопПараметры.Вставить("СтатусПредставление", НСтр("ru = 'Не выполнена';
														|en = 'Failed'"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"УстановитьСтатусОперацийЗавершение", 
		ЭтотОбъект, ДопПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура Операции_УстановитьСтатусПропущена(Команда)
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Операции);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Ссылка Из ВыделенныеСтроки Цикл
		
		Если НЕ Элементы.Операции.ДанныеСтроки(Ссылка).МожноПропустить Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Выделенные операции не могут быть пропущены.';
											|en = 'Selected operations cannot be skipped.'"));
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстВопроса = НСтр("ru = 'У выделенных в списке операций будет установлен статус ""Пропущена"". Продолжить?';
						|en = 'Status of the operations selected in the list will be set to Skipped. Continue?'");
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Операции", ВыделенныеСтроки);
	ДопПараметры.Вставить("Статус", "Пропущена");
	ДопПараметры.Вставить("СтатусПредставление", НСтр("ru = 'Пропущена';
														|en = 'Skipped'"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"УстановитьСтатусОперацийЗавершение", 
		ЭтотОбъект, ДопПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОперацийЗавершение(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	КоличествоОбработанных = ОбщегоНазначенияУТВызовСервера.УстановитьСтатусДокументов(
		ДопПараметры.Операции,
		ДопПараметры.Статус);
	
	ОбщегоНазначенияУТКлиент.ОповеститьПользователяОбУстановкеСтатуса(
		Элементы.Операции,
		КоличествоОбработанных,
		ДопПараметры.Операции.Количество(),
		ДопПараметры.СтатусПредставление);
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Операции);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Операции, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Операции);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Элементы.Операции);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаЖурналОпераций Тогда
		Элементы.Операции.Обновить();
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаВыполнениеОпераций Тогда
		Элементы.ВыполнениеОпераций.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#Область ВыполнениеОпераций

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	
	ПодразделениеПриИзмененииНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборУчастокПриИзменении(Элемент)
	
	УчастокПриИзмененииНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОтбораПодразделениеПриИзменении(Элемент)
	
	Если ТипОтбораПодразделение = 1 Тогда
		
		Подразделение = Неопределено;
		ПодразделениеПриИзмененииНаСервере(Истина);
		
	Иначе
		
		Участок = Неопределено;
		УчастокПриИзмененииНаСервере(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОтбораРабочийЦентрПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(РабочийЦентр) Тогда
		ЗначениеОтбораДоИзменения = РабочийЦентр;
	Иначе
		ЗначениеОтбораДоИзменения = Неопределено;
	КонецЕсли;
	
	УстановитьТипРабочегоЦентра(ЭтаФорма);
	
	Если ЗначениеОтбораДоИзменения <> Неопределено
		И ЗначениеОтбораДоИзменения <> РабочийЦентр Тогда
		УстановитьОтборПоРабочемуЦентру();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборРабочийЦентрПриИзменении(Элемент)
	
	УстановитьОтборПоРабочемуЦентру();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтборСостояниеНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Перечисление", Тип("ПеречислениеСсылка.СостоянияВыполненияОпераций"));
	ПараметрыФормы.Вставить("ВыбранныеЗначения", Состояние.ВыгрузитьЗначения());
	
	ОткрытьФорму("Обработка.ВыполнениеОпераций2_2.Форма.ВыборЗначенийПеречисления",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеНачалоВыбораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено 
		И РезультатЗакрытия <> КодВозвратаДиалога.Отмена Тогда
		
		Состояние.ЗагрузитьЗначения(РезультатЗакрытия);
		УстановитьОтборПоСостоянию();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	
	УстановитьОтборПоСостоянию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеОчистка(Элемент, СтандартнаяОбработка)
	
	Если Состояние.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Состояние.Очистить();
	
	УстановитьОтборПоСостоянию();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если Поле.Имя = "ВыполнениеОперацийОперация" Тогда
			ПоказатьЗначение(, ТекущиеДанные.Операция);
		ИначеЕсли Найти("ВыполнениеОперацийЭтап,ВыполнениеОперацийПредставлениеЭтапа" ,Поле.Имя) Тогда
			ПоказатьЗначение(, ТекущиеДанные.Этап);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеОперацийПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационноеСообщениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОтключитьОтборПоЭтапу" Тогда
		
		СтандартнаяОбработка = Ложь;
		УстановитьОтборПоЭтапам();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Операции

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	
	УстановитьОтборПоИсполнителю();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИсполнительНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПроизводствоКлиент.ОткрытьФормуВыбораИсполнителя(
		Неопределено,
		Подразделение,
		Исполнитель,
		Неопределено,
		,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ИсполнительПолучениеДанныхВыбора(ДанныеВыбора, Текст, Подразделение);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ИсполнительПолучениеДанныхВыбора(ДанныеВыбора, Текст, Подразделение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	
	УстановитьОтборПоСтатусу();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтборСтатусНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Перечисление", Тип("ПеречислениеСсылка.СтатусыПроизводственныхОпераций"));
	ПараметрыФормы.Вставить("ВыбранныеЗначения", Статус.ВыгрузитьЗначения());
	
	ОткрытьФорму("Обработка.ВыполнениеОпераций2_2.Форма.ВыборЗначенийПеречисления",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусНачалоВыбораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено 
		И РезультатЗакрытия <> КодВозвратаДиалога.Отмена Тогда
	
		Статус.ЗагрузитьЗначения(РезультатЗакрытия);
		УстановитьОтборПоСтатусу();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОперации

&НаКлиенте
Процедура ОперацииПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоСостоянию()
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
		ВыполнениеОпераций.Отбор,, "ГруппаОтбораПоСостоянию");
		
	НаборСостояний = Состояние.ВыгрузитьЗначения();
	
	Если НаборСостояний.ВГраница() <> -1 Тогда
		
		ОтборГруппа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			ВыполнениеОпераций.Отбор.Элементы, "ГруппаОтбораПоСостоянию", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
		Для каждого СостояниеЗначение Из НаборСостояний Цикл
			
			Если СостояниеЗначение = Перечисления.СостоянияВыполненияОпераций.ОжиданиеПредшествующих Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппа, "ОжиданиеПредшествующих", 0, ВидСравненияКомпоновкиДанных.Больше,, Истина);
			ИначеЕсли СостояниеЗначение = Перечисления.СостоянияВыполненияОпераций.НачатаПредшествующая Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппа, "НачатыПредшествующие", 0, ВидСравненияКомпоновкиДанных.Больше,, Истина);
			ИначеЕсли СостояниеЗначение = Перечисления.СостоянияВыполненияОпераций.МожноВыполнять Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппа, "МожноВыполнять", 0, ВидСравненияКомпоновкиДанных.Больше,, Истина);
			ИначеЕсли СостояниеЗначение = Перечисления.СостоянияВыполненияОпераций.Выполняется Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппа, "Выполняется", 0, ВидСравненияКомпоновкиДанных.Больше,, Истина);
			ИначеЕсли СостояниеЗначение = Перечисления.СостоянияВыполненияОпераций.Пропущена Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппа, "Пропущено", 0, ВидСравненияКомпоновкиДанных.Больше,, Истина);
			ИначеЕсли СостояниеЗначение = Перечисления.СостоянияВыполненияОпераций.Завершена Тогда
				ОтборГруппаВыполнено = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
					ОтборГруппа.Элементы, "ГруппаОтбораПоСостояниюВыполнено", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппаВыполнено, "Выполнено", 0, ВидСравненияКомпоновкиДанных.Больше,, Истина);	
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппаВыполнено, "ОжиданиеПредшествующих", 0, ВидСравненияКомпоновкиДанных.Равно,, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппаВыполнено, "НачатыПредшествующие", 0, ВидСравненияКомпоновкиДанных.Равно,, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппаВыполнено, "МожноВыполнять", 0, ВидСравненияКомпоновкиДанных.Равно,, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппаВыполнено, "Выполняется", 0, ВидСравненияКомпоновкиДанных.Равно,, Истина);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	НастроитьЗависимыеЭлементыФормы("Состояние");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоИсполнителю()
	
	ОтборПоНоменклатуре = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		Операции.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы,
		НСтр("ru = 'Отбор по исполнителю';
			|en = 'Filter by assignee'"),
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	Если ПроизводствоСервер.ИспользуетсяУчетТрудозатратВРазрезеСотрудников(ТекущаяДатаСеанса()) Тогда
		
		ФизЛицо = ?(ЗначениеЗаполнено(Исполнитель),
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Исполнитель, "ФизическоеЛицо"),
			Неопределено);
		
		Исполнители = Новый Массив;
		Исполнители.Добавить(Исполнитель);
		Исполнители.Добавить(ФизЛицо);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ОтборПоНоменклатуре,
			"Ссылка.Исполнитель",
			ВидСравненияКомпоновкиДанных.ВСписке,
			Исполнители,
			,
			ЗначениеЗаполнено(Исполнитель));
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ОтборПоНоменклатуре,
			"Ссылка.Трудозатраты.Исполнитель",
			ВидСравненияКомпоновкиДанных.ВСписке,
			Исполнители,
			,
			ЗначениеЗаполнено(Исполнитель));
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ОтборПоНоменклатуре,
			"Ссылка.Исполнитель",
			ВидСравненияКомпоновкиДанных.Равно,
			Исполнитель,
			,
			ЗначениеЗаполнено(Исполнитель));
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ОтборПоНоменклатуре,
			"Ссылка.Трудозатраты.Исполнитель",
			ВидСравненияКомпоновкиДанных.Равно,
			Исполнитель,
			,
			ЗначениеЗаполнено(Исполнитель));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоСтатусу()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Операции, 
		"Статус", 
		Статус, 
		ВидСравненияКомпоновкиДанных.ВСписке,
		, 
		ЗначениеЗаполнено(Статус));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоЭтапам(СписокЭтапов = Неопределено)
	
	УстановленОтбор = ЗначениеЗаполнено(СписокЭтапов);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ВыполнениеОпераций,
			"Этап",
			СписокЭтапов,
			ВидСравненияКомпоновкиДанных.ВСписке,
			,
			УстановленОтбор);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Операции,
			"Этап",
			СписокЭтапов,
			ВидСравненияКомпоновкиДанных.ВСписке,
			,
			УстановленОтбор);
	
	Если УстановленОтбор Тогда
		СформироватьНадписьУстановленОтборПоЭтапам(СписокЭтапов);
	Иначе
		ОчиститьИнформационноеСообщение();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоРабочемуЦентру()
	
	УстановленОтбор = ЗначениеЗаполнено(РабочийЦентр);
	
	Если УстановленОтбор И ТипОтбораРабочийЦентр = 1 Тогда
		ЗначениеОтбора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочийЦентр, "ВидРабочегоЦентра");
	Иначе
		ЗначениеОтбора = РабочийЦентр;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ВыполнениеОпераций, 
			"ВидРабочегоЦентра", 
			ЗначениеОтбора, 
			ВидСравненияКомпоновкиДанных.Равно,
			, 
			УстановленОтбор);
		
	Если ТипОтбораРабочийЦентр = 1 Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Операции, 
				"РабочийЦентр", 
				РабочийЦентр, 
				ВидСравненияКомпоновкиДанных.Равно,
				, 
				УстановленОтбор);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Операции, 
				"ВидРабочегоЦентра", 
				,
				,
				,
				Ложь);
				
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				ВыполнениеОпераций, 
				"РабочийЦентр", 
				РабочийЦентр,
				ВидСравненияКомпоновкиДанных.Равно,
				,
				УстановленОтбор);
					
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Операции, 
				"РабочийЦентр", 
				,
				,
				,
				Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Операции, 
				"ВидРабочегоЦентра", 
				РабочийЦентр, 
				ВидСравненияКомпоновкиДанных.Равно,
				, 
				УстановленОтбор);
				
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				ВыполнениеОпераций, 
				"РабочийЦентр", 
				,
				,
				,
				Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПодразделениюУчастку() 
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ВыполнениеОпераций,
		"Подразделение",
		Подразделение,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ВыполнениеОпераций,
		"Участок",
		Участок,
		ВидСравненияКомпоновкиДанных.Равно,
		, 
		ТипОтбораПодразделение = 1);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Операции, 
		"Подразделение", 
		Подразделение, 
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Операции,
		"Участок",
		Участок,
		ВидСравненияКомпоновкиДанных.Равно,
		, 
		ТипОтбораПодразделение = 1);
	
	ПараметрыФО = Новый Структура(
		"Подразделение",
		?(ЗначениеЗаполнено(Подразделение), Подразделение, Неопределено));
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере(ИзмененТипОтбора)
	
	Подразделение = ?(Участок.Пустая(),
		Неопределено,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Участок, "Владелец"));
		
	ПодразделениеПриИзмененииНаСервере(ИзмененТипОтбора);
	
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере(ИзмененТипОтбора)
	
	УстановитьТипРабочегоЦентра(ЭтаФорма);
	УстановитьТипИсполнителя();
	
	УстановитьОтборПоПодразделениюУчастку();
	УстановитьОтборПоРабочемуЦентру();
	УстановитьОтборПоИсполнителю();
	
	Если ИзмененТипОтбора Тогда
		
		НастроитьЗависимыеЭлементыФормы("ТипОтбораПодразделение");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипИсполнителя()
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		
		УправлениеПроизводствомКлиентСервер.УстановитьТипИсполнителя(
			Исполнитель,
			ПроизводствоСервер.ПараметрыПроизводственногоПодразделения(Подразделение).ИспользоватьБригадныеНаряды,
			ПроизводствоСервер.ИспользуетсяУчетТрудозатратВРазрезеСотрудников(ТекущаяДатаСеанса()));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНадписьУстановленОтборПоЭтапам(СписокЭтапов)
	
	МассивСтрок = Новый Массив;
	
	Если СписокЭтапов.Количество() > 1 Тогда
		
		МассивСтрок.Добавить(НСтр("ru = 'Установлен отбор по списку этапов';
									|en = 'Filter by stage list is set'"));
		
	Иначе
		
		РеквизитыЭтапа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СписокЭтапов[0], "Номер, НаименованиеЭтапа"); 
		ПредставлениеЭтапа = Документы.ЭтапПроизводства2_2.ПредставлениеЭтапа(РеквизитыЭтапа);
		
		МассивСтрок.Добавить(НСтр("ru = 'Установлен отбор по этапу';
									|en = 'Stage filter is set'"));
		МассивСтрок.Добавить(" ");
		
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
			ПредставлениеЭтапа,
			,
			,
			,
			ПолучитьНавигационнуюСсылку(СписокЭтапов[0])));
		
	КонецЕсли;
	
	МассивСтрок.Добавить(" (");
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'отключить';
															|en = 'disable'"),,,, "ОтключитьОтборПоЭтапу"));
	
	МассивСтрок.Добавить(") ");
	
	ИнформационноеСообщение = Новый ФорматированнаяСтрока(МассивСтрок);
	
	НастроитьЗависимыеЭлементыФормы("ИнформационноеСообщение");
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьИнформационноеСообщение()
	
	ИнформационноеСообщение = Неопределено;
	НастроитьЗависимыеЭлементыФормы("ИнформационноеСообщение");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Оформление цветом ожидающих предшествующие операции
	#Область ВыполнениеОпераций_ОжиданиеПредшествующих
	
	Элемент = ВыполнениеОпераций.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Выполняется");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("МожноВыполнять");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СерыйЦветТекста1);
		
	#КонецОбласти 
	
	// Оформление поля Дата в списке операций
	#Область Операции_Дата
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтаФорма, "Операции.Дата", Элементы.ОперацииДата.Имя);
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваДинамическогоСпискаОперации()
	
	ТекстЗапроса = Операции.ТекстЗапроса;
	
	Документы.ЭтапПроизводства2_2.ВыполнитьПодстановкуПоляПредставлениеЭтапа(ТекстЗапроса, "&ПредставлениеЭтапа", "ОперацииПереопределяемый.Этап");

	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	
	СвойстваСписка.ТекстЗапроса                 = ТекстЗапроса;
	СвойстваСписка.ОсновнаяТаблица              = Операции.ОсновнаяТаблица;
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Операции, СвойстваСписка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваДинамическогоСпискаВыполнениеОпераций()
	
	ТекстЗапроса = ВыполнениеОпераций.ТекстЗапроса;
	
	Документы.ЭтапПроизводства2_2.ВыполнитьПодстановкуПоляПредставлениеЭтапа(ТекстЗапроса, "&ПредставлениеЭтапа", "ОчередьПереопределяемый.Этап");

	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	
	СвойстваСписка.ТекстЗапроса                 = ТекстЗапроса;
	СвойстваСписка.ОсновнаяТаблица              = ВыполнениеОпераций.ОсновнаяТаблица;
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.ВыполнениеОпераций, СвойстваСписка);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЗависимыеЭлементыФормы(СписокРеквизитов = "")
	
	Инициализация = ПустаяСтрока(СписокРеквизитов);
	СтруктураРеквизитов = Новый Структура(СписокРеквизитов);
	
	Если Инициализация ИЛИ СтруктураРеквизитов.Свойство("ТипОтбораПодразделение") Тогда
	
		Элементы.ОтборПодразделение.Видимость = (ТипОтбораПодразделение = 0);
		Элементы.ОтборПодразделение1.Видимость = (ТипОтбораПодразделение = 0);
		Элементы.ОтборУчасток.Видимость = (ТипОтбораПодразделение = 1);
		Элементы.ОтборУчасток1.Видимость = (ТипОтбораПодразделение = 1);
		
		Связи = Новый Массив;
		Связи.Добавить(Новый СвязьПараметраВыбора("Отбор.Подразделение", "Подразделение"));
		Если ТипОтбораПодразделение = 1 Тогда
			Связи.Добавить(Новый СвязьПараметраВыбора("Отбор.Участок", "Участок"));
		КонецЕсли;
		
		Элементы.ОтборРабочийЦентр.СвязиПараметровВыбора = Новый ФиксированныйМассив(Связи);
		Элементы.ОтборРабочийЦентр1.СвязиПараметровВыбора = Новый ФиксированныйМассив(Связи);
		
	КонецЕсли;
	
	Если Инициализация ИЛИ СтруктураРеквизитов.Свойство("Состояние") Тогда
		
		Если ТолькоАктивныеСостояния(Состояние) Тогда
			СостояниеСтрока = НСтр("ru = 'Незавершенные';
									|en = 'Unfinished'");
		Иначе
			СостояниеСтрока = СтрСоединить(Состояние.ВыгрузитьЗначения(), ";");
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("ИнформационноеСообщение") Тогда
		
		ЗаполненоИнформационноеСообщение = ЗначениеЗаполнено(ИнформационноеСообщение);
		
		Элементы.ИнформационноеСообщение1.Видимость = ЗаполненоИнформационноеСообщение;
		Элементы.ИнформационноеСообщение2.Видимость = ЗаполненоИнформационноеСообщение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуДобавленияОперации(ТекущиеДанные, РежимРаботы)
	
	КлючОперации = УправлениеПроизводствомКлиентСервер.КлючПроизводственнойОперации();
	ЗаполнитьЗначенияСвойств(КлючОперации, ТекущиеДанные);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючОперации", КлючОперации);
	ПараметрыФормы.Вставить("РежимРаботы", РежимРаботы);
	ПараметрыФормы.Вставить("РабочийЦентр", ТекущиеДанные.РабочийЦентр);
	ПараметрыФормы.Вставить("Участок", ТекущиеДанные.Участок);
	ПараметрыФормы.Вставить("НомерПартии", 	ТекущиеДанные.НомерПартии);
	
	ИмяОткрываемойФормы = "Обработка.ВыполнениеОперацийПриПланировании.Форма.ДобавитьОперацию";
		
	ОткрытьФорму(ИмяОткрываемойФормы,
		ПараметрыФормы,
		ЭтаФорма,
		,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

&НаКлиенте
Функция ОткрытьФормуСпискаОпераций(ТекущиеДанные, РежимРаботы)
	
	КлючОперации = УправлениеПроизводствомКлиентСервер.КлючПроизводственнойОперации();
	ЗаполнитьЗначенияСвойств(КлючОперации, ТекущиеДанные);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючОперации", КлючОперации);
	ПараметрыФормы.Вставить("РежимРаботы", РежимРаботы);
	
	ПараметрыФормы.Вставить("РабочийЦентр", ТекущиеДанные.РабочийЦентр);
	ПараметрыФормы.Вставить("НомерПартии", 	ТекущиеДанные.НомерПартии);
	
	ИмяОткрываемойФормы = "Обработка.ВыполнениеОперацийПриПланировании.Форма.СписокОпераций";
	
	ОткрытьФорму(ИмяОткрываемойФормы,
		ПараметрыФормы,
		ЭтаФорма,
		,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

&НаКлиенте
Процедура ИсполнительНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Исполнитель = Результат;
		УстановитьОтборПоИсполнителю();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИсполнительПолучениеДанныхВыбора(ДанныеВыбора, Текст, Подразделение)
	
	ДанныеВыбора = Новый СписокЗначений;
	ПараметрыОтбора = Новый Структура("Организация, Подразделение, Дата");
	ПараметрыОтбора.Подразделение = Подразделение;
	ПараметрыОтбора.Дата = ТекущаяДатаСеанса();
	ПроизводствоСервер.ЗаполнитьДанныеВыбораПриВводеИсполнителя(ДанныеВыбора, Текст, ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТипРабочегоЦентра(Форма)
	
	Если Форма.ТипОтбораРабочийЦентр = 0 Тогда
		ДопустимыйТип = Новый ОписаниеТипов("СправочникСсылка.ВидыРабочихЦентров");
	Иначе
		ДопустимыйТип = Новый ОписаниеТипов("СправочникСсылка.РабочиеЦентры");
	КонецЕсли;
	
	Форма.РабочийЦентр = ДопустимыйТип.ПривестиЗначение(Форма.РабочийЦентр);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	МассивСсылок = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
	Если МассивСсылок.Количество() > 0 Тогда
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВыполнениеОпераций Тогда
			ПоказатьЗначение(Неопределено, МассивСсылок[0]);
		Иначе
			Элементы.Операции.ТекущаяСтрока = МассивСсылок[0];
			Если Элементы.Операции.ТекущаяСтрока = Неопределено Тогда
				ПоказатьЗначение(Неопределено, МассивСсылок[0]);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)
	
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ПроизводственнаяОперация2_2.ПустаяСсылка"));
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
	
КонецФункции

&НаСервере
Процедура ОперацииНазначитьРабочийЦентрНаСервере(Операции, РабочийЦентр, ВариантНаладки = Неопределено)
	
	Документы.ПроизводственнаяОперация2_2.НазначитьРабочийЦентрОперациям(Операции, РабочийЦентр, ВариантНаладки);
	
	Элементы.Операции.Обновить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция АктивныеСостояния()
	
	Состояния = Новый Массив;
	
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияВыполненияОпераций.ОжиданиеПредшествующих"));
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияВыполненияОпераций.НачатаПредшествующая"));
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияВыполненияОпераций.МожноВыполнять"));
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияВыполненияОпераций.Выполняется"));
	
	Возврат Состояния;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТолькоАктивныеСостояния(СписокСостояний)
	
	АктивныеСостояния = АктивныеСостояния();
	
	Если АктивныеСостояния.Количество() <> СписокСостояний.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого ЭлементКоллекции Из СписокСостояний Цикл
		Если АктивныеСостояния.Найти(ЭлементКоллекции.Значение) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
